mss/dmxpainter/src/pins_atmega8.h
#pragma once

// Ext. interrupt 0
#define PIN_INT0  PIN_4

// Ext. interrupt 1
#define PIN_INT1  PIN_5

// Timer 0
#define PIN_T0    PIN_6

// Timer 1
#define PIN_T1    PIN_11
#define PIN_ICP1  PIN_14
#define PIN_OC1A  PIN_15
#define PIN_OC1B  PIN_16

// Timer 2
#define PIN_OC2   PIN_17
#define PIN_TOSC1 PIN_9
#define PIN_TOSC2 PIN_10

// USART
#define PIN_RXD   PIN_2
#define PIN_TXD   PIN_3
#define PIN_XCK   PIN_6

// TWI
#define PIN_SCL   PIN_28
#define PIN_SDA   PIN_27

// SPI
#define PIN_SCK   PIN_19
#define PIN_MISO  PIN_18
#define PIN_MOSI  PIN_17
#define PIN_SS    PIN_16

// Analog Comparator
#define PIN_AIN0  PIN_12
#define PIN_AIN1  PIN_13

// A/D Converter
#define PIN_ADC0  PIN_23
#define PIN_ADC1  PIN_24
#define PIN_ADC2  PIN_25
#define PIN_ADC3  PIN_26
#define PIN_ADC4  PIN_27
#define PIN_ADC5  PIN_28

// Reset
#define PIN_RESET PIN_1

// Ext. Oscillator
#define PIN_XTAL1 PIN_9
#define PIN_XTAL2 PIN_10


// The pin-map

#define PIN_1  C,6
#define PIN_2  D,0
#define PIN_3  D,1
#define PIN_4  D,2
#define PIN_5  D,3
#define PIN_6  D,4
#define PIN_7  _,VCC
#define PIN_8  _,GND
#define PIN_9  B,6
#define PIN_10 B,7
#define PIN_11 D,5
#define PIN_12 D,6
#define PIN_13 D,7
#define PIN_14 B,0
#define PIN_15 B,1
#define PIN_16 B,2
#define PIN_17 B,3
#define PIN_18 B,4
#define PIN_19 B,5
#define PIN_20 _,AVCC
#define PIN_21 _,AREF
#define PIN_22 _,GND
#define PIN_23 C,0
#define PIN_24 C,1
#define PIN_25 C,2
#define PIN_26 C,3
#define PIN_27 C,4
#define PIN_28 C,5
